### Ans_1

In [2]:
import pandas as pd

course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']

duration = [2,3,6,4]

df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

To print the data present in the second row of the DataFrame df, you can use the .iloc[ ] indexing method.

In [4]:
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

The index represents the row number, and each value is associated with its corresponding column labe

In [5]:
df.iloc[1].to_frame().T

        course_name duration
1  Machine Learning        3

<h>ans_2

In pandas, loc and iloc are used to select rows and columns from a DataFrame.

loc is primarily label based, which means that we have to specify the name of the row or column which we want to select. It selects data based on row and column labels, where the row label is based on the DataFrame's index, and the column label is based on the column name.

In [8]:
df.loc[2, 'duration']

6

iloc, on the other hand, is primarily integer position based, which means that we have to specify the integer location of the rows and columns which we want to select. It selects data based on the integer position of the row and column

In [9]:
df.iloc[1, 0]

'Machine Learning'

<h>ans_3

In [23]:
reindex = [3, 0, 1, 2]
new_df = pd.DataFrame(df,index = reindex)
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [13]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [14]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

Yes, there is a difference in the outputs of both the commands new_df.loc[2] and new_df.iloc[2].

new_df.loc[2] returns the row of data that has the label or index value equal to 2. In the original DataFrame df, the row with index 2 had the data ['Big Data', 6]. But after reindexing, the row with index 2 is now holding the data of original row with index 1 [Machine Learning ,	3]. So, new_df.loc[2] will return the data of row no. 4 after reindexing, which is ['Big Data', 6].

new_df.iloc[2] returns the row of data that is present at the 2nd position (i.e. the 3rd row), regardless of the row label or index. After reindexing, the 3rd row in new_df holds the data [Machine Learning	 ,3]. So, new_df.iloc[2] will return the data of 3rd row after reindexing, which is [Machine Learning,3].while df.iloc[2] would return ['Big Data', 6],

## code to generate new dataframe

In [7]:
import pandas as pd

import numpy as np

columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']

indices = [1,2,3,4,5,6]


df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.564949  0.232485  0.963624  0.797062  0.399272  0.280634
2  0.428493  0.867567  0.067204  0.256346  0.032708  0.426207
3  0.119585  0.607237  0.533435  0.795086  0.767260  0.128699
4  0.877832  0.097954  0.268622  0.952361  0.976182  0.736814
5  0.386541  0.696540  0.421324  0.580883  0.772196  0.486928
6  0.880983  0.654774  0.039269  0.265178  0.672015  0.720207

<h>ans_4

In [8]:
# (i) Mean of each and every column
column_means = df1.mean()
print("Mean of each column:")
print(column_means)

Mean of each column:
column_1    0.543064
column_2    0.526093
column_3    0.382246
column_4    0.607819
column_5    0.603272
column_6    0.463248
dtype: float64

In [11]:
# (ii) Standard deviation of column 'column_2'
target_column = 'column_2'
std_dev_column_2 = df1[target_column].std()
print(f"Standard deviation of {target_column}:")
print(std_dev_column_2)

Standard deviation of column_2:
0.2960771623183072

<h>ans_5

In [32]:
df1.loc[2, 'column_2'] = 'some string'

In [33]:
 df1.mean()

TypeError: unsupported operand type(s) for +: 'float' and 'str'

Since the values in 'column_2' are float type, it is not sensible to replace it with a string variable. It will result in a TypeError.if we had changed it some sensable string which can be converted to float thenwe can still find mean.

In [40]:
df1.loc[2, 'column_2'] = '4.367'
df1['column_2'] = df1['column_2'].astype(float) # converting back to float type
df1['column_2'].mean()

1.1691779205446853

<h>ans_6

In pandas, window functions are used to perform operations on a moving window of data points. A window function can be applied to a rolling or expanding window of data points based on a specified window size and a set of aggregation functions. These functions are especially useful in time-series analysis and data manipulation tasks.

There are several types of window functions available in pandas, some of them are:

Rolling Window: This window function is used to perform calculations on a fixed-size moving window of the DataFrame.

Expanding Window: This window function is used to perform calculations on all data points in the DataFrame up to a certain point.

Exponential Moving Window: This window function assigns exponentially decreasing weights to each data point in the window.

Rolling Apply: This window function is used to apply custom functions to rolling windows.

Rolling Sum, Mean, Min, Max: These are some of the basic aggregation functions that can be used with the rolling window function

<h>ans_7

In [43]:
pd.datetime

C:\Users\hp\AppData\Local\Temp\ipykernel_1372\3478089931.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  pd.datetime

datetime.datetime

The pandas.datetime function has been deprecated and replaced by pandas.Timestamp

In [48]:
now = pd.Timestamp.now()
now

Timestamp('2023-05-07 23:48:16.872671')

In [52]:
now.month ,now.year ,

(5, 2023)

or we can use

In [49]:
from datetime import datetime
datetime.now()

datetime.datetime(2023, 8, 10, 23, 13, 27, 746090)

<h>ans_8

In [53]:
import pandas as pd


date1_str = input("Enter the first date in YYYY-MM-DD format: ")
date2_str = input("Enter the second date in YYYY-MM-DD format: ")

# Convert input strings to Pandas datetime objects
date1 = pd.to_datetime(date1_str)
date2 = pd.to_datetime(date2_str)


time_diff = date2 - date1

# Extract days, hours, and minutes from the time difference
days = time_diff.days
hours = time_diff.seconds // 3600
minutes = (time_diff.seconds % 3600) // 60


print(f"The difference between {date1_str} and {date2_str} is {days} days, {hours} hours, and {minutes} minutes.")

Enter the first date in YYYY-MM-DD format: 2003-04-29
Enter the second date in YYYY-MM-DD format: 2005-6-12
The difference between 2003-04-29 and 2005-6-12 is 775 days, 0 hours, and 0 minutes.

<h>ans_9

In [60]:
import pandas as pd


file_path = input("Enter file path: ")
column_name = input("Enter column name: ")
category = input("Enter category: ")


df = pd.read_csv(file_path)

# Convert specified column to categorical data type
df[column_name] = df[column_name].astype('category')

# Assign category to specified column
df[column_name] = df[column_name].cat.set_categories([category])

# Sort data based on specified column
df = df.sort_values(column_name)

df

Enter file path: titanic.csv
Enter column name: Sex
Enter category: female

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
571,572,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S
567,568,0,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.0750,NaN,S
564,565,0,3,"Meanwell, Miss. (Marion Ogden)",female,NaN,0,0,SOTON/O.Q. 392087,8.0500,NaN,S
559,560,1,3,"de Messemaeker, Mrs. Guillaume Joseph (Emma)",female,36.0,1,0,345572,17.4000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",NaN,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",NaN,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",NaN,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",NaN,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",NaN,32.0,0,0,370376,7.7500,NaN,Q

## INPUTS
- titanic.csv
- Sex
- female

## Ans_10

In [13]:
import pandas as pd
import matplotlib.pyplot as plt

file_path = input("Enter file path: ")

data = pd.read_csv(file_path)

# Assuming the CSV file has columns: 'Date', 'Product_Category', and 'Sales'
# You can adjust these column names based on your actual CSV structure

# Convert 'Date' column to datetime type
data['Date'] = pd.to_datetime(data['Date'])

# Pivot the data to create a DataFrame suitable for a stacked bar chart
pivot_data = data.pivot_table(index='Date', columns='Product_Category', values='Sales', aggfunc='sum')

# Create a stacked bar chart
pivot_data.plot(kind='bar', stacked=True, figsize=(10, 6))
plt.title('Sales by Product Category Over Time')
plt.xlabel('Date')
plt.ylabel('Sales')
plt.legend(title='Product Category')

plt.show()

## Ans_11

In [18]:
import pandas as pd

file_path = input("Enter file path containing Student Data: ")

df = pd.read_csv(file_path)
df

Enter file path containing Student Data:  student_data.csv

   STUDENT ID   TEST SCORE
0            1          85
1            2          90
2            3          80
3            4          75
4            5          85
5            6          82
6            7          78
7            8          85
8            9          90
9           10          85

In [21]:
mean = df["TEST SCORE"].mean()
mean

83.5

In [24]:
median = df["TEST SCORE"].median()
median

85.0

In [29]:
mode = df["TEST SCORE"].mode()
mode[0]

85

In [41]:
table_dict = {
               "STATISTIC" :   ["Mean"  ,"Median"  ,  "Mode"] ,
               "VALUE " : [ df["TEST SCORE"].mean() , df["TEST SCORE"].median(), df["TEST SCORE"].mode()[0] ]
             }

In [42]:
pd.DataFrame(table_dict , index = [1,2,3])

  STATISTIC  VALUE
1      Mean    83.5
2    Median    85.0
3      Mode    85.0